app/views/users/show.html.erb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <tr>
        <% car=Car.find(selectedcars.car_id) %>