app/views/reservations/manage_reservation.erb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <tr>
            <% car=Car.find(reservation.car_id) %>