app/views/reservations/search_car.erb

SELECT "cars".* FROM "cars" WHERE "cars"."location" = ?  [["location", "raleigh"]]
SELECT "cars".* FROM "cars" WHERE "cars"."model" = ?  [["model", "alto"]]
---
        <%= f.label :location %>
        <%= f.select :location, options_from_collection_for_select(Car.all.to_a.uniq{ |o| o.location}, :location, :location), {:prompt => "Select.."}%>
        <%= f.label :car %>
        <%= f.select :model, options_from_collection_for_select(Car.all.to_a.uniq{ |o| o.model}, :model, :model), {:prompt => "Select.."}%>

SELECT "cars".* FROM "cars" WHERE "cars"."style" = ?  [["style", "sedane"]]
---
        <%= f.label :car_type %>
        <%= f.select :style, options_from_collection_for_select(Car.all.to_a.uniq{ |o| o.style}, :style, :style), {:prompt => "Select.."}%>