app/views/reservations/show.html.erb

    <% @showing_reservation.each do |reservation| %>
        <% car=Car.find(reservation.car_id) %>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]