app/controllers/cars_controller.rb

  def index
    @cars = Car.all
    @user = User.find(session[:user_id])
---
SELECT "cars".* FROM "cars"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @car=Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def view_car_history
    puts "ddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd #{params[:acc_type]}"
    @carreservation= Reservation.where("car_id =?",params[:acc_type])
---
SELECT "reservations".* FROM "reservations" WHERE (car_id ='4')

  def create
    @car = Car.new(car_params)
    if params[:sgg_no].nil?
    else
       @suggestions=Suggestion.where("id =?",params[:sgg_no])
       @suggestions.delete_all
    end
    respond_to do |format|
      if @car.save
---
DELETE FROM "suggestions" WHERE (id ='4')
INSERT INTO "cars" ("model", "manufacturer", "status", "lic_no", "hourly_rate", "style", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    set_car
    @reservation=Reservation.where("car_id =?",set_car.id).where("status =?","Reserved").or(Reservation.where("car_id =?",set_car.id).where("status =?","Checkout"))
    if(@reservation.empty?)
      @car.destroy
---
SELECT  1 AS one FROM "reservations" WHERE ((car_id =14) AND (status ='Reserved') OR (car_id =14) AND (status ='checkout')) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 2]]