app/controllers/reservations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE (user_id =4)
---
  def show
    user=User.find(session[:user_id]).id
    @showing_reservation=Reservation.where("user_id =?",user)

SELECT "cars".* FROM "cars" WHERE (id ='11')
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "emailtos" ("user_id", "email", "car_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "4"], ["email", "ss@ncsu.edu"], ["car_id", "11"], ["created_at", "2017-10-05 16:11:16.879907"], ["updated_at", "2017-10-05 16:11:16.879907"]]
---
  def notify_car
    @carrr=params[:car]
    @cardetails=Car.where("id =?",@carrr)
    email=Emailto.new
    email.user_id=User.find(session[:user_id]).id
    email.name=User.find(session[:user_id]).name
    email.email=User.find(session[:user_id]).email
    email.car_id=@carrr
    @cardetails.each{|x|
      email.model=x.model
      email.manufacturer=x.manufacturer
      email.lic_no=x.lic_no
      email.hourly_rate=x.hourly_rate
      email.style=x.style
    }
    email.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ?  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "reservations" WHERE (user_id =1) AND (status ='Reserved') LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def reserve_car
    @reservationcar = Reservation.new
    @carrr=params[:car]
    puts "#{@carrr} hello"
    @carselected=Car.all
    @carselected = @carselected.where(id: params[:car])
    @user = User.find(session[:user_id])
    @user_list=User.where("user_type =?","user")
    @reservation=Reservation.where("user_id =?",User.find(session[:user_id]).id).where("status =?","Reserved")
    if @reservation.empty?

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "reservations" ("car_id", "user_id", "checkout_date", "return_date", "checkout_time", "return_time", "cost", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def reserve
    #puts "in reserve"
    #puts "in reserve"
    @reservation = Reservation.new(reservation_parameters)
    @selected_car_id=params[:car_id]
    @useradmin=User.find(session[:user_id]).user_type
    if @useradmin == "admin"
      puts "hii: #{@reservation.user_id} "
      @selected_user_id=@reservation.user_id
      if @selected_user_id.nil?
        respond_to do |format|
          format.html { redirect_to search_car_path, notice: 'Please Select User while selecting timings' }
          format.json { head :no_content }
        end
        else
        @selected_hourly_rate=params[:hourly_rate]
        @reservation.car_id=@selected_car_id
        @reservation.user_id=@selected_user_id
        @reservation.cost=@selected_hourly_rate
        @reservation.status="Reserved"
        @reservation.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
          else
            @somedate = DateTime.new(@localcheckouttime.to_i)
            @selected_car_id=params[:car_id]
            @useradmin=User.find(session[:user_id]).user_type

SELECT COUNT(*) FROM "reservations" WHERE (user_id =5 AND status='Reserved')
---
              else

                @showing_reservation=Reservation.where("user_id =? AND status=?",@reservation.user_id, "Reserved")
                puts "asfklasjfaskljflasjfnlasjflasnf :: #{@showing_reservation.count}"

INSERT INTO "reservations" ("car_id", "user_id", "checkout_date", "return_date", "checkout_time", "return_time", "cost", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
                  @reservation.user_id=@selected_user_id
                  @reservation.cost=@selected_hourly_rate
                  @reservation.status="Reserved"
                  @reservation.save

SELECT "users".* FROM "users" WHERE (user_type ='üser')
---
  def manage_reservation
    @user= User.new
    @user_list=User.where("user_type =?","user")

SELECT  "reservations".* FROM "reservations" WHERE (user_id =4) AND (status ='Reserved') AND "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "cars" ("id", "model", "manufacturer", "status", "lic_no", "hourly_rate", "style", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "reservations" ("id", "car_id", "user_id", "checkout_date", "return_date", "checkout_time", "return_time", "cost", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]
SELECT  "cars".* FROM "cars" WHERE (id =11) AND "cars"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def checkout
    @reservation=Reservation.where("user_id =?",User.find(session[:user_id]).id).where("status =?","Reserved")
    @reservation1=Reservation.new
    @reservation.each{|x|
      @id= x.id
      @reservation1.id=x.id
      @cars_id=x.car_id
      @reservation1.car_id=x.car_id
      @reservation1.user_id=x.user_id
      @reservation1.checkout_date=x.checkout_date
      @reservation1.checkout_time=x.checkout_time
      @reservation1.return_date=x.return_date
      @reservation1.return_time=x.return_time
      @reservation1.actual_return_time=x.actual_return_time
      @reservation1.cost=x.cost
      @reservation1.created_at=x.created_at
      @reservation1.updated_at=x.updated_at
      @reservation1.status="Checkout"
      }
      @reservation.destroy(@id)
      @reservation1.save
      @cars=Car.where("id =?",@cars_id)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 11]]
---
        @cars1.created_at=x.created_at
        @cars1.updated_at=x.updated_at
      }
      @cars.destroy(@idcar)

SELECT  "reservations".* FROM "reservations" WHERE (user_id =4) AND (status ='Checkout') AND "reservations"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "cars" ("id", "model", "manufacturer", "status", "lic_no", "hourly_rate", "style", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "reservations" ("id", "car_id", "user_id", "checkout_date", "return_date", "checkout_time", "return_time", "cost", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 31]]
SELECT  "cars".* FROM "cars" WHERE (id =11) AND "cars"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def return
    @reservation=Reservation.where("user_id =?",User.find(session[:user_id]).id).where("status =?","Checkout")
    @reservation1=Reservation.new
    @reservation.each{|x|
      @id= x.id
      @reservation1.id=x.id
      @cars_id=x.car_id
      @reservation1.car_id=x.car_id
      @reservation1.user_id=x.user_id
      @reservation1.checkout_date=x.checkout_date
      @reservation1.checkout_time=x.checkout_time
      @reservation1.return_date=x.return_date
      @reservation1.return_time=x.return_time
      @reservation1.actual_return_time=x.actual_return_time
      @reservation1.cost=x.cost
      @reservation1.created_at=x.created_at
      @reservation1.updated_at=x.updated_at
      @reservation1.status="Avaliable"
    }
    @reservation.destroy(@id)
    @reservation1.save
    @cars=Car.where("id =?",@cars_id)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 11]]
SELECT "emailtos".* FROM "emailtos" WHERE "emailtos"."car_id" = ?  [["car_id", "11"]]
DELETE FROM "emailtos" WHERE "emailtos"."id" = ?  [["id", 4]]
---
      @cars1.created_at=x.created_at
      @cars1.updated_at=x.updated_at
    }
    @cars.destroy(@idcar)
    @cars1.save
    NotifyMailer.new_notify(@cars_id).deliver_now
    @emaildetails=Emailto.where("car_id =?",@cars_id.to_s)
    @emaildetails.delete_all

SELECT  "reservations".* FROM "reservations" WHERE (user_id =4) AND (status ='Reserved') AND "reservations"."id" = ? LIMIT ?  [["id", 80], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "cars" ("id", "model", "manufacturer", "status", "lic_no", "hourly_rate", "style", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "reservations" ("id", "car_id", "user_id", "checkout_date", "return_date", "checkout_time", "return_time", "cost", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 80]]
SELECT  "cars".* FROM "cars" WHERE (id =11) AND "cars"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def cancel
    @reservation=Reservation.where("user_id =?",User.find(session[:user_id]).id).where("status =?","Reserved")
    @reservation1=Reservation.new
    @reservation.each{|x|
      @id= x.id
      @reservation1.id=x.id
      @cars_id=x.car_id
      @reservation1.car_id=x.car_id
      @reservation1.user_id=x.user_id
      @reservation1.checkout_date=x.checkout_date
      @reservation1.checkout_time=x.checkout_time
      @reservation1.return_date=x.return_date
      @reservation1.return_time=x.return_time
      @reservation1.actual_return_time=x.actual_return_time
      @reservation1.cost=x.cost
      @reservation1.created_at=x.created_at
      @reservation1.updated_at=x.updated_at
      @reservation1.status="Avaliable"
    }
    @reservation.destroy(@id)
    @reservation1.save
    @cars=Car.where("id =?",@cars_id)

DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 11]]
---
      @cars1.updated_at=x.updated_at
      @cars1.updated_at=x.updated_at
    }
    @cars.destroy(@idcar)