app/controllers/suggestions_controller.rb

  def index
    @suggestions = Suggestion.all
---
SELECT "suggestions".* FROM "suggestions"

  def new
    @suggestion = Suggestion.new
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @suggestion = Suggestion.new(suggestion_params)

    respond_to do |format|
      if @suggestion.save
---
INSERT INTO "suggestions" ("model", "manufacture", "style", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["model", "TATA"], ["manufacture", "TATA"], ["style", "tata"], ["created_at", "2017-10-10 00:17:20.815374"], ["updated_at", "2017-10-10 00:17:20.815374"]]

  def destroy
    @suggestion.destroy
---
DELETE FROM "suggestions" WHERE "suggestions"."id" = ?  [["id", 1]]

    def set_suggestion
      @suggestion = Suggestion.find(params[:id])
---
SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]