app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", "user"]]
---
  def index
      @users = User.where(user_type: "user").all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE (user_id =4) AND (status ='Reserved')
SELECT  1 AS one FROM "reservations" WHERE (user_id =4) AND (status ='Reserved') LIMIT ?  [["LIMIT", 1]]
---
  def show
    @user = User.find(session[:user_id])
    user=User.find(session[:user_id]).id
    @car=Car.all
    @reservation= Reservation.where("user_id =?",user).where("status =?","Reserved")
    if(@reservation.empty?)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @user = User.new
    if logged_in?
      @current_user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    if params[:id].empty?
      @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "user_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if logged_in?
      @current_user = User.find(session[:user_id])
    end
    @user = User.new(user_params)
    if logged_in?
      if @current_user.user_type=="admin" or @current_user.user_type=="superadmin" and params[:acc_type] == 'admin'

        @user.user_type= "admin"
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", "admin"]]
---
    def view_admins
      @user = User.find(session[:user_id])
    @users= User.where(user_type:  "admin").all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", "superadmin"]]
---
  def view_superadmins
    @user = User.find(session[:user_id])
    @users= User.where(user_type:  "superadmin").all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "MADHU"], ["password_digest", "$2a$10$coypaPZLDmd5dY7ZfVKFYe7HJWdte44fLbGhDnaObr8atEivLWvUa"], ["updated_at", "2017-10-05 07:24:31.657464"], ["id", 5]]
---
  def update
    if params[:acc_id].empty?
      render 'edit'
    else
      @user= User.find(params[:acc_id])
      if @user.password_digest.empty?
        puts "hello"
      else @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "reservations" WHERE ((user_id =29) AND (status ='Reserved') OR (user_id =29) AND (status ='checkout')) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    @user = User.find(params[:id])
    @reservation=Reservation.where("user_id =?",@user.id).where("status =?","Reserved").or(Reservation.where("user_id =?",@user.id).where("status =?","Checkout"))
    if @reservation.empty?
      @user.destroy