app/views/cars/view_car_history.erb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
          <tr>
            <% car=Car.find(reservation.car_id) %>
            <% user=User.find(reservation.user_id) %>